Description: Downloads the latest version of Microsoft Azure Storage Explorer.
Identifier: com.github.markkenny.autopkg.download.MicrosoftAzureStorageExplorer
MinimumVersion: 2.3

Input:
  NAME: Microsoft Azure Storage Explorer
  PRODUCTID: '708342'
  DOWNLOADURL: https://go.microsoft.com/fwlink/?linkid=%PRODUCTID%

Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.zip'
    url: '%DOWNLOADURL%'

- Processor: EndOfCheckPhase

- Processor: Unarchiver
  Arguments:
    archive_format: zip
    archive_path: '%pathname%'
    destination_path: '%RECIPE_CACHE_DIR%/Applications'
    purge_destination: true

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%RECIPE_CACHE_DIR%/Applications/Microsoft Azure Storage Explorer.app'
    requirement: identifier "com.microsoft.StorageExplorer" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = UBF8T346G9
