Description: Downloads the current release version of Tableau Reader and builds a package.
Identifier: com.github.markkenny.autopkg.pkg.tableau-reader
ParentRecipe: com.github.markkenny.autopkg.download.tableau-reader
MinimumVersion: 2.3

Input:
  NAME: Tableau Reader

Process:
- Processor: PkgCopier
  Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/Tableau Reader-%version%.pkg'
    source_pkg: '%pathname%/Tableau Reader.pkg'
