Description: Downloads the latest version of Atlassiam Companion and renames the package with Version.
Identifier: com.github.markkenny.autopkg.pkg.AtlassianCompanion
ParentRecipe: com.github.markkenny.autopkg.download.AtlassianCompanion
MinimumVersion: 2.3

Input:
  NAME: Atlassian Companion

Process:
- Processor: AppPkgCreator
