Description: Downloads latest OmniPlan 4 disk image.
Identifier: com.github.markkenny.autopkg.download.omniplan4
MinimumVersion: 2.3

Input:
  NAME: OmniPlan4

Process:
- Processor: SparkleUpdateInfoProvider
  Arguments:
    appcast_url: https://update.omnigroup.com/appcast/com.omnigroup.OmniPlan4

- Processor: URLDownloader

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/OmniPlan.app'
    requirement: identifier "com.omnigroup.OmniPlan4" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "34YW5XSRB7"

- Processor: EndOfCheckPhase
