Comment: For the ARCH_TYPE variable use "mac" for Intel, use "macM1" for Apple Silicon
Description: Packages the current release version of DataGrip.
Identifier: com.github.markkenny.autopkg.pkg.datagrip
ParentRecipe: com.github.markkenny.autopkg.download.datagrip
MinimumVersion: 2.3

Input:
  NAME: DataGrip

Process:
- Processor: AppPkgCreator
  Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'
