<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Packages the current release version of PhpStorm.</string>
	<key>Comment</key>
	<string>For the ARCH_TYPE variable use "mac" for Intel, use "macM1" for Apple Silicon</string>
	<key>Identifier</key>
    <string>com.github.Omnicom-Group.autopkg-recipes.pkg.phpstorm</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>PhpStorm</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
    <string>com.github.Omnicom-Group.autopkg-recipes.download.phpstorm</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
