Description: Download the latest release of the OpenWebStart installer from GitHub. Taken from NStraus and added platform
Identifier: com.github.markkenny.autopkg.download.OpenWebStart
MinimumVersion: '1.0'

Input:
  NAME: OpenWebStart

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    asset_regex: ^.*(macos-%ARCH%).*$
    github_repo: karakun/OpenWebStart

- Processor: URLDownloader
  Arguments:
    filename: OpenWebStart-%ARCH%-%version%.dmg
