Comment: Created by MK 2023 08 15
Description: Downloads the latest version of Evercast and creates a package.
Identifier: com.github.markkenny.autopkg.pkg.Evercast
ParentRecipe: com.github.markkenny.autopkg.download.Evercast
MinimumVersion: 2.3

Input:
  NAME: Evercast
  BUNDLE_ID: us.evercast.Evercast

Process:
- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      Applications: '0775'
    pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: FlatPkgUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/expanded'
    flat_pkg_path: '%pathname%'

- Processor: PkgPayloadUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/%NAME%/Applications'
    pkg_payload_path: '%RECIPE_CACHE_DIR%/expanded/evercast.pkg/Payload'

- Processor: PlistReader
  Arguments:
    info_path: '%RECIPE_CACHE_DIR%/%NAME%/Applications/Evercast.app/Contents/Info.plist'
    plist_keys:
      CFBundleShortVersionString: jamfversion
      CFBundleVersion: version
      LSMinimumSystemVersion: min_os_version

- Processor: PkgCreator
  Arguments:
    pkg_request:
      chown:
      - group: admin
        path: Applications
        user: root
      id: '%BUNDLE_ID%'
      options: purge_ds_store
      pkgname: '%NAME%-%jamfversion%'
      version: '%jamfversion%'

- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/expanded'
    - '%RECIPE_CACHE_DIR%/%NAME%'
