Description: |
  Downloads the latest Spotify.
  For Apple Silicon set DOWNLOAD_ARCH to "ARM64" and SUPPORTED_ARCH to "arm64" (default)
  For Intel leave DOWNLOAD_ARCH empty and set SUPPORTED_ARCH to "x86_64""
Identifier: com.github.markkenny.autopkg.download.spotify
MinimumVersion: 2.3

Input:
  NAME: Spotify
  DOWNLOAD_ARCH: ARM64
  SUPPORTED_ARCH: arm64

Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-%SUPPORTED_ARCH%.dmg'
    url: https://download.scdn.co/Spotify%DOWNLOAD_ARCH%.dmg

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/Spotify.app'
    requirement: identifier "com.spotify.client" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2FNC3A47ZF"
