Comment: Created 2023 09 07 MK
Description: Downloads the latest ARM version of logseq.
Identifier: com.github.markkenny.autopkg.download.logseq
MinimumVersion: 2.3

Input:
  NAME: Logseq
  DOWNLOAD_ARCHITECTURE: arm64
  DOWNLOAD_REGEX: Logseq-darwin-%DOWNLOAD_ARCHITECTURE%.*\.dmg$

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    asset_regex: '%DOWNLOAD_REGEX%'
    github_repo: logseq/logseq

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-%version%.dmg'

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/Logseq.app'
    requirement: identifier "com.electron.logseq" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "3K44EUN829"

- Processor: Versioner
  Arguments:
    input_plist_path: '%pathname%/Logseq.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
