Description: Downloads the latest Onyx client for macOS 13 and builds a .pkg
Identifier: com.github.markkenny.autopkg.pkg.OnyX13
ParentRecipe: com.github.markkenny.autopkg.download.OnyX13
MinimumVersion: 1.0.1

Input:
  NAME: Onyx

Process:
- Processor: AppPkgCreator

- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/payload'
