Comment: Created by MK 2023 05 05
Description: Downloads the latest version of Topaz Sharpen.
Identifier: com.github.markkenny.autopkg.download.topaz-sharpen
MinimumVersion: 2.3

Input:
  NAME: Topaz Sharpen

Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.dmg'
    url: https://downloads.topazlabs.com/deploy/TopazSharpenAI/latest/TopazSharpenAI-Full-Installer.dmg

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/Topaz Sharpen AI.app'
    requirement: identifier "com.topazlabs.TopazSharpenAI" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "3G3JE37ZHF"

- Processor: Versioner
  Arguments:
    input_plist_path: '%pathname%/Topaz Sharpen AI.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
