Description: Downloads the latest version of Topaz Sharpen and creates a package.
Identifier: com.github.markkenny.autopkg.pkg.topaz-sharpen
ParentRecipe: com.github.markkenny.autopkg.download.topaz-sharpen
MinimumVersion: 2.3

Input:
  NAME: Topaz Sharpen

Process:
- Processor: AppPkgCreator
  Arguments:
    app_path: '%pathname%/Topaz Sharpen AI.app'
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'
