Comment: For the ARCH_TYPE variable use "mac" for Intel, use "macM1" for Apple Silicon
Description: Downloads the current release version of PyCharm Professional Edition.
Identifier: com.github.markkenny.autopkg.download.pycharm-pe
ParentRecipe: com.github.markkenny.autopkg.download.jetbrains
MinimumVersion: 2.3

Input:
  NAME: PyCharm-PE
  ARCH_TYPE: mac
  PROD_CODE: PCP
  CSV_REQ: identifier "com.jetbrains.pycharm" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2ZEFAR8TH3"
