Comment: For the ARCH_TYPE variable use "mac" for Intel, use "macM1" for Apple Silicon
Description: Packages the current release version of PyCharm Professional Edition.
Identifier: com.github.markkenny.autopkg.pkg.pycharm-pe
ParentRecipe: com.github.markkenny.autopkg.download.pycharm-pe
MinimumVersion: 2.3

Input:
  NAME: PyCharm-PE

Process:
- Processor: AppPkgCreator
  Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'
