Description: Downloads latest OmniPlan 4 disk image builds a package.
Identifier: com.github.markkenny.autopkg.pkg.omniplan4
ParentRecipe: com.github.markkenny.autopkg.download.omniplan4
MinimumVersion: 2.3

Input:
  NAME: OmniPlan4

Process:
- Processor: AppDmgVersioner
  Arguments:
    dmg_path: '%pathname%'

- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      Applications: '0775'
    pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: Copier
  Arguments:
    destination_path: '%pkgroot%/Applications/%app_name%'
    source_path: '%pathname%/%app_name%'

- Processor: PkgCreator
  Arguments:
    pkg_request:
      chown:
      - group: admin
        path: Applications
        user: root
      id: '%bundleid%'
      options: purge_ds_store
      pkgname: '%NAME%-%version%'
      version: '%version%'
