Comment: Created by MK 2023 02 13
Description: Downloads the latest version of Hive.
Identifier: com.github.markkenny.autopkg.download.Hive
MinimumVersion: 2.3

Input:
  NAME: Hive

Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.dmg'
    url: https://s3.amazonaws.com/hv-desktop-mac/HiveInstaller.dmg

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/Hive.app'
    requirement: identifier "com.hivetechnology.hive" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = EF2FKNHD5L

- Processor: Versioner
  Arguments:
    input_plist_path: '%pathname%/Hive.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
