Comment: Created by MK 2023 02 13
Description: Downloads the latest version of Hive and creates a package.
Identifier: com.github.markkenny.autopkg.pkg.Hive
ParentRecipe: com.github.markkenny.autopkg.download.Hive
MinimumVersion: 2.3

Input:
  NAME: Hive

Process:
- Processor: AppPkgCreator
