Description: Downloads the current version of Lucid. MK 20240416 as URL changed

Identifier: com.github.markkenny.autopkg.download.lucid

MinimumVersion: "2.3"

Input:
  NAME: Lucid
  SEARCH_URL: https://www.lucidlink.com/download
  SEARCH_PATTERN: lucid-[0-9\.]*.pkg
  DOWNLOAD_URL: https://d3il9duqikhdqy.cloudfront.net/latest/osx

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: "%SEARCH_PATTERN%"
      url: "%SEARCH_URL%"

  - Processor: URLDownloader
    Arguments:
      url: "%DOWNLOAD_URL%/%match%"
      filename: "%NAME%.pkg"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%"
      expected_authority_names:
        - "Developer ID Installer: LucidLink Corp. (Y4KMJPU2B4)"
        - Developer ID Certification Authority
        - Apple Root CA
