Description: Downloads the latest Spotify dmg and creates a pkg from it.
Identifier: com.github.markkenny.autopkg.pkg.spotify
ParentRecipe: com.github.markkenny.autopkg.download.spotify
MinimumVersion: 2.3

Input:
  NAME: Spotify

Process:
- Processor: AppDmgVersioner
  Arguments:
    dmg_path: '%pathname%'

- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      Applications: '0775'
    pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: Copier
  Arguments:
    destination_path: '%pkgroot%/Applications/Spotify.app'
    source_path: '%pathname%/Spotify.app'

- Processor: PkgCreator
  Arguments:
    pkg_request:
      chown:
      - group: admin
        path: Applications
        user: root
      id: '%bundleid%'
      options: purge_ds_store
      pkgdir: '%RECIPE_CACHE_DIR%'
      pkgname: '%NAME%-%SUPPORTED_ARCH%-%version%'
