Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of EBS and creates a package. (Does not include the NDI Runtime) Must be uninstalled if upgrading
Identifier: com.github.markkenny.autopkg.pkg.EBS
ParentRecipe: com.github.markkenny.autopkg.download.EBS
MinimumVersion: 2.3

Input:
  NAME: EBS

Process:
- Processor: AppPkgCreator
