Comment: Created by MK 2023 02 13
Description: Downloads Wireshark and creates a package.
Identifier: com.github.markkenny.autopkg.pkg.Wireshark
ParentRecipe: com.github.markkenny.autopkg.download.Wireshark
MinimumVersion: 2.3

Input:
  NAME: Wireshark

Process:
- Processor: AppPkgCreator
  Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%ARCHITECTURE%-%version%.pkg'
