Description: Downloads the latest Scribe Desktop.
Identifier: com.github.markkenny.autopkg.download.scribedesktop
MinimumVersion: 2.3

Input:
  NAME: Scribe Desktop

Process:
- Processor: SparkleUpdateInfoProvider
  Arguments:
    appcast_url: https://colony-labs-public.s3.us-east-2.amazonaws.com/mac-updates/appcast.xml

- Processor: com.github.homebysix.FindAndReplace/FindAndReplace
  Comment: The Screens Sparkle feed contains a double-encoded download URL, so we must manually fix it here.
  Arguments:
    find: '%2520'
    input_string: '%url%'
    replace: '%20'

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-%version%.dmg'
    url: '%output_string%'

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/Scribe Desktop.app'
    requirement: identifier "com.scribehow.ScribeDesktop" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = WXS28YE368)
