Description: Packges the latest download of Scribe Desktop.
Identifier: com.github.markkenny.autopkg.pkg.scribedesktop
ParentRecipe: com.github.markkenny.autopkg.download.scribedesktop
MinimumVersion: 2.3

Input:
  NAME: Scribe Desktop

Process:
- Processor: AppPkgCreator
  Arguments:
    app_path: '%pathname%/Scribe Desktop.app'
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'
