Description: Downloads the latest version of GPG Suite using creates a package.
Identifier: com.github.markkenny.autopkg.pkg.gpg
ParentRecipe: com.github.markkenny.autopkg.download.gpg
MinimumVersion: 2.3

Input: {}

Process:
- Processor: PkgCopier
  Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/GPGSuite-%version%.pkg'
    source_pkg: '%pathname%/Install.pkg'
