Comment: Created by MK 2023 08 14
Description: Downloads and packages the latest Frame IO
Identifier: com.github.markkenny.autopkg.pkg.frameio
ParentRecipe: com.github.markkenny.autopkg.download.frameio
MinimumVersion: 2.3

Input:
  NAME: Frame IO Transfer

Process:
- Processor: AppPkgCreator
  Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'
