Description: Downloads the current release of Tableau Desktop.
Identifier: com.github.markkenny.autopkg.download.tableau-desktop
MinimumVersion: 2.3

Input:
  NAME: Tableau Desktop

Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.dmg'
    url: https://www.tableau.com/downloads/desktop/mac

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    expected_authority_names:
    - 'Developer ID Installer: Tableau Software, LLC (QJ4XPRK37C)'
    - Developer ID Certification Authority
    - Apple Root CA
    input_path: '%pathname%/Tableau Desktop.pkg'

- Processor: FlatPkgUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/unpacked'
    flat_pkg_path: '%pathname%/Tableau Desktop.pkg'

- Processor: PkgPayloadUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/expanded'
    pkg_payload_path: '%RECIPE_CACHE_DIR%/unpacked/Tableau App.pkg/payload'
    purge_destination: true

- Processor: FileFinder
  Arguments:
    pattern: '%RECIPE_CACHE_DIR%/expanded/Tableau Desktop*.app/Contents/Info.plist'

- Processor: Versioner
  Arguments:
    input_plist_path: '%found_filename%'
    plist_version_key: CFBundleShortVersionString
