Description: Downloads the current release version of Tableau Public and builds a package.
Identifier: com.github.markkenny.autopkg.pkg.tableau-public
ParentRecipe: com.github.markkenny.autopkg.download.tableau-public
MinimumVersion: 2.3

Input:
  NAME: Tableau Public

Process:
- Processor: FlatPkgUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/expanded'
    flat_pkg_path: '%pathname%/*.pkg'

- Processor: PkgPayloadUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/unpack'
    pkg_payload_path: '%RECIPE_CACHE_DIR%/expanded/Tableau App.pkg/Payload'
    purge_destination: 'true'

- Processor: Versioner
  Arguments:
    input_plist_path: '%RECIPE_CACHE_DIR%/unpack/Tableau Public.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString

- Processor: PkgCopier
  Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'
    source_pkg: '%pathname%/*.pkg'

- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/expanded'
    - '%RECIPE_CACHE_DIR%/unpack'
