Description: Downloads the current release version of Tableau Desktop and builds a package.
Identifier: com.github.markkenny.autopkg.pkg.tableau-desktop
ParentRecipe: com.github.markkenny.autopkg.download.tableau-desktop
MinimumVersion: 2.3

Input:
  NAME: Tableau Desktop

Process:
- Processor: PkgCopier
  Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/Tableau Desktop-%version%.pkg'
    source_pkg: '%pathname%/Tableau Desktop.pkg'
