Description: Downloads the current release version of Tableau Prep and builds a package.
Identifier: com.github.markkenny.autopkg.pkg.tableau-prep
ParentRecipe: com.github.markkenny.autopkg.download.tableau-prep
MinimumVersion: 2.3

Input:
  NAME: Tableau Prep

Process:
- Processor: PkgCopier
  Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/Tableau Prep-%version%.pkg'
    source_pkg: '%pathname%/Tableau Prep Builder.pkg'
