Description: Downloads the current release 30 day trial version of Capture One. Orginal version by com.github.foigus.download.CaptureOne
Identifier: com.github.markkenny.autopkg.download.captureone
MinimumVersion: 2.3

Input:
  NAME: CaptureOne

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: '"latestCOVersions":.+?(https:\/\/downloads\.captureone\.pro\/[\dabcdef]+\/CaptureOne\.Mac[\d\.]+\.dmg)'
    url: https://www.captureone.com/en/account/download-trial

- Processor: URLDownloader
  Arguments:
    filename: CaptureOne.dmg
    url: '%match%'

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/Capture One.app'
    requirement: anchor apple generic and identifier "com.captureone.captureone16" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "5WTDB5F65L")
