Description: Downloads the latest version of ZBrush (part of Red Giant Complete) Cloned from FOIGUS.
Identifier: com.github.markkenny.autopkg.download.zBrush
MinimumVersion: 2.3

Input:
  NAME: ZBrush

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: \/_nuxt\/static\/[\d]+\/en\/downloads\/payload\.js
    result_output_var_name: url_stub
    url: https://www.maxon.net/en/downloads

- Processor: URLTextSearcher
  Arguments:
    re_pattern: https:\\u002F\\u002Fmx-app-blob-prod.maxon.net\\u002Fmx-package-production\\u002Finstaller\\u002Fmacos\\u002Fredgiant\\u002Fmagicbullet\\u002Freleases\\u002F[\d\.]+\\u002FMagicBulletSuite-[\d\.]+_[Mm]ac.zip
    result_output_var_name: encoded_download_url
    url: https://www.maxon.net%url_stub%

- Processor: com.github.homebysix.FindAndReplace/FindAndReplace
  Arguments:
    find: \u002F
    input_string: '%encoded_download_url%'
    replace: /

- Processor: URLDownloader
  Arguments:
    url: '%output_string%'

- Processor: EndOfCheckPhase

- Processor: Unarchiver
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/unarchive'
    purge_destination: true

- Processor: FileFinder
  Arguments:
    pattern: '%RECIPE_CACHE_DIR%/unarchive/Magic Bullet*Installer.app'

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%found_filename%'
    requirement: anchor apple generic and identifier "com.redgiant.MagicBullet-Suite-Installer" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "4ZY22YGXQG")
